In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r"C:\Users\22rit\OneDrive\Documents\Datasets\titanic.csv")

In [3]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
target = df.Survived
inputs=df.drop('Survived',axis='columns')

In [6]:
from sklearn.preprocessing import LabelEncoder

In [7]:
le = LabelEncoder()

In [8]:
inputs['Sex'] = le.fit_transform(inputs['Sex'])

In [9]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [11]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [12]:
inputs.drop('Sex',axis='columns')

     Pclass        Age     Fare
0         3  22.000000   7.2500
1         1  38.000000  71.2833
2         3  26.000000   7.9250
3         1  35.000000  53.1000
4         3  35.000000   8.0500
..      ...        ...      ...
886       2  27.000000  13.0000
887       1  19.000000  30.0000
888       3  29.699118  23.4500
889       1  26.000000  30.0000
890       3  32.000000   7.7500

[891 rows x 3 columns]

In [13]:
from sklearn.model_selection import train_test_split

In [14]:
x_train , x_test , y_train , y_test = train_test_split(inputs,target,test_size=0.2)

In [15]:
len(x_train)

712

In [16]:
len(x_test)

179

In [17]:
len(inputs)

891

In [18]:
from sklearn.naive_bayes import GaussianNB

In [19]:
model = GaussianNB()

In [20]:
model.fit(x_train,y_train)

GaussianNB()

In [21]:
model.score(x_test,y_test)

0.7374301675977654

In [22]:
x_test[:10]

     Pclass  Sex        Age     Fare
187       1    1  45.000000  26.5500
218       1    0  32.000000  76.2917
863       3    0  29.699118  69.5500
861       2    1  21.000000  11.5000
840       3    1  20.000000   7.9250
7         3    1   2.000000  21.0750
59        3    1  11.000000  46.9000
726       2    0  30.000000  21.0000
712       1    1  48.000000  52.0000
747       2    0  30.000000  13.0000

In [23]:
y_test[:10]

187    1
218    1
863    0
861    0
840    0
7      0
59     0
726    1
712    1
747    1
Name: Survived, dtype: int64

In [24]:
model.predict(x_test[:10])

array([0, 1, 1, 0, 0, 0, 0, 1, 0, 1], dtype=int64)

In [25]:
model.score(x_test[:10],y_test[:10])

0.7

In [27]:
model.predict_proba(x_test[:10])

array([[0.83170439, 0.16829561],
       [0.02330518, 0.97669482],
       [0.18748575, 0.81251425],
       [0.92619757, 0.07380243],
       [0.96303088, 0.03696912],
       [0.93907755, 0.06092245],
       [0.93414125, 0.06585875],
       [0.25570213, 0.74429787],
       [0.75450667, 0.24549333],
       [0.25721973, 0.74278027]])